Tekla Open API Reference for Tekla Structures 2025
StructuresExtender.GetAttributeName Method
 Retrieves the AttributeName text associated with the specified control.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string GetAttributeName(
	Control control
)
Public Function GetAttributeName (
	control As Control
) As String
Parameters
control
Type: System.Windows.Forms.Control
The control for which to retrieve the AttributeName text.
Return Value
Type: String
 A string containing the AttributeName text for the specified control, or null if no text is associated with the specified control.
See Also
Reference
StructuresExtender Class
Tekla.Structures.Dialog Namespace